app/Controllers/Admin.php

SELECT SUM(cantidad) AS total
FROM `sale_detail`
---
    public function dashboardAdmin(){

        $userModel = new UserModel();
        $shoeModel = new ShoeModel();
        $saleHeader = new SaleHeaderModel();
        $saleDetailModel = new saleDetailModel();

        $data['lastMonthSales'] = $saleDetailModel->select('SUM(cantidad) AS total')
                                                  ->find();