app/Controllers/UserController.php

    public function signinSubmit(){
        $input = $this->validate([
            'email'    => 'required',
            'password'     => 'required'
       ],);

       if (!$input) {
         $data['title']='Login';
         echo view('front/pages/HeaderPage',$data);
         echo view('front/components/navbar');
         echo view('back/users/signin', ['validation' => $this->validator]);
         echo view('front/components/footer');
         return;
        } else {

            $formModel = new UserModel();

            $email = $this->request->getVar('email');
            $password = $this->request->getVar('password');

            $user = $formModel->where('email', $email)
                              ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@admin.com'
 LIMIT 1