app/Models/CategoryModel.php

SELECT *
FROM `categories`
---
        public function get_categories() {
            return $this->findAll();