app/Models/GenderModel.php

SELECT *
FROM `genders`
---
        public function get_genders() {
            return $this->findAll();