app/Models/SaleHeaderModel.php

        public function getLastBuys(){
            return $this->join('users', ' userId = users.id')
                        ->where('received', 0)
                        ->orderBy('sale_createdAt', 'DESC')
                        ->limit(7)
                        ->find();
---
SELECT *
FROM `sale_header`
JOIN `users` ON `userId` = `users`.`id`
WHERE `received` = 0
ORDER BY `sale_createdAt` DESC
 LIMIT 7