app/Models/ShoeModel.php

SELECT *
FROM `shoes`
JOIN `categories` ON `category` = `categories`.`categoryId`
ORDER BY `createdAt` DESC
---
        public function get_shoes_admin(){
            return $this->join('categories', 'category = categories.categoryId')
                        ->orderBy('createdAt', 'DESC')->findAll();

SELECT *
FROM `shoes`
JOIN `categories` ON `category` = `categories`.`categoryId`
WHERE `id` = '47'
 LIMIT 1
---
        public function get_shoe($id){
            return $this->join('categories', 'category = categories.categoryId')
                        ->where('id', $id)->first();

SELECT *
FROM `shoes`
WHERE `stock` <= 5
---
        public function get_shoes_por_agotarse(){
            return $this->where('stock <=', ($this->minstock + 5))
                        ->findAll();