app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` != 'admin@admin.com'
AND `rol_id` != 1
---
        public function get_users() {
            if(session()->get('inMainAdmin')){
                return $this->where('email !=', session()->get('email'))->findAll();
            }else{
                return $this->where('email !=', session()->get('email'))
                            ->where('rol_id !=', 1)
                            ->findAll();